Study2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Гарантия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТовара</name>
    <type>
      <types>EnumRef.ВидыТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассНоменклатуры</name>
    <type>
      <types>EnumRef.КлассНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментныйСтатус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоплектующиеДляРазбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Study2/src/InformationRegisters/СвойстваТовара/СвойстваТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваТовара</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ДополнительныеСвойстваТовара</types>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеСвойстваТовара</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Study2/src/InformationRegisters/КлассНоменклатуры/КлассНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлассНоменклатуры</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Класс</name>
    <type>
      <types>EnumRef.КлассНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Study2/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ДополнительнаяИнформация = ЭтотОбъект.Параметры.ПереданнаяИнформация;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ("ВЫБРАТЬ
	|	ДополнительныеСвойстваТовара.Ссылка КАК Свойства,
	|	СвойстваТовара.Значение КАК Значение,
	|	&Товар КАК Товар
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеСвойстваТовара КАК ДополнительныеСвойстваТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваТовара КАК СвойстваТовара
	|		ПО (ДополнительныеСвойстваТовара.Ссылка = СвойстваТовара.Свойство)
	|			И (СвойстваТовара.Товар = &Товар)");
	
	Запрос.УстановитьПараметр("Товар", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Таблица.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.АссортиментныйСтатус = ВыборКартинкиДляКлассаНоменклатуры(Объект.КлассНоменклатуры);
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидТовара) Тогда
		Отказ = Истина;
		Сообщить("Не заполнено поле ""Вид товара""");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыборКартинкиДляКлассаНоменклатуры(КлассНоменклатуры)
	
	Если КлассНоменклатуры = Перечисления.КлассНоменклатуры.А Тогда
		Значение = 28;
	ИначеЕсли КлассНоменклатуры = Перечисления.КлассНоменклатуры.В Тогда
		Значение = 29;
	ИначеЕсли КлассНоменклатуры = Перечисления.КлассНоменклатуры.С Тогда
		Значение = 32;
	ИначеЕсли КлассНоменклатуры = Перечисления.КлассНоменклатуры.СнятСПродаж Тогда
		Значение = 34;
	Иначе 
		Значение = 35;
	КонецЕсли; 
	
	Возврат Значение
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого Строка из Таблица Цикл
		МЗ = РегистрыСведений.СвойстваТовара.СоздатьМенеджерЗаписи();
		МЗ.Товар = Объект.Ссылка;
		МЗ.Свойство = Строка.Свойства;
		МЗ.Значение = Строка.Значение;
		МЗ.Записать();
	КонецЦикла; 
	
	// Создание записи в РС.КлассНоменклатуры
	МЗ = РегистрыСведений.КлассНоменклатуры.СоздатьМенеджерЗаписи();
	МЗ.Период = ТекущаяДата();
	МЗ.Номенклатура = Объект.Ссылка;
	МЗ.Класс = Объект.КлассНоменклатуры;
	МЗ.Записать();
	
КонецПроцедуры
